Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Обновить существующие записи в таблице — позволяет выбрать ключевое поле, по которому будет происходить обновление записей.
en: Update existing table records enables to select the key field by which records will be updated.

source: Обновить Обновить — обновить список папок.
en: Update Update enables to update the folder list.

source: Обновить Обновить — обновить список пользователей и их параметров.
en: Update Update: update the list of users and their parameters.

source: Обновить Обновить — подгружает параметры используемые в данный момент.
en: Update Update enables to upload currently used parameters.

source: Обнуление заголовка (PERSIST).
en: Persist (PERSIST).

source: Обработка данных
en: Data processing

source: Обработчики
en: Handlers

source: Образец — при клике на эту кнопку открывается таблица обозначений, которые можно использовать при составлении шаблона.
en: Example: by pressing this button, it is possible to open the table of symbols used to create a template.

source: Обрамлять имена кавычками — если имена объектов базы данных (например, имена таблиц, полей) содержат пробелы или зарезервированные символы, то необходимо использовать обрамляющие символы, фиксирующие начало и конец имени.
en: Quote names: if the database objects names (for example, names of tables, fields) contain spaces or reserved characters, it is required to use framing characters fixing the name start and end.

source: Обрамлять имена кавычками — если имена объектов базы данных (например, имена таблиц, полей) содержат пробелы или зарезервированные символы, то необходимо использовать обрамляющие символы, фиксирующие начало и конец имени;
en: Quote names: if the database objects names (for example, names of tables, fields) contain spaces or reserved characters, it is required to use framing characters fixing the name start and end.

source: Обратная разность — уникальные значения упорядочиваются, после чего каждое уникальное значение сравнивается с предыдущим по таблице вида:
en: Backward difference: the unique values are ordered, then each unique value is compared with the previous one according to the following table:

source: Обратный Гельмерт — уникальные значения упорядочиваются, после чего каждое уникальное значение сравнивается со средним из предыдущих значений по таблице вида:
en: Reverse Helmert: the unique values are ordered, then each unique value is compared with the average value from the previous values according to the following table:

source: Обучающее — cтруктурированный набор данных, применяемый для обучения аналитических моделей.
en: Train: the structured data set used for training of analytical models.

source: Обучение (переобучение) узла
en: Node training (retraining)

source: Общее число записей — число записей таблицы входного источника данных.
en: Total records: the records count of the input data source table.

source: Общие настройки
en: General settings

source: Общие папки
en: Shared folders

source: Общие папки Общие папки
en: Shared Folders Shared Folders

source: Объединение переменных — объединяет два или более наборов переменных в один набор;
en: Union of variables enables to combine two or more sets of variables into one set.

source: Объединение
en: Union

source: Объединение Объединение
en: Union Union

source: Объединять подсказки — объединяет всплывающие подсказки всех серий (при наведении курсором мыши на серию), если для каждой серии они были настроены отдельно.
en: Combine tooltips enables to combine the pop-up tooltips of all series (when hovering cursor over the series) if they have been separately configured for each series.

source: Объекты хранилища данных — содержит древовидный список Процессы Процессов и Измерения Измерений из которых необходимо выбрать лишь один объект — Процесс Процесс или Измерение Измерение.
en: Data Warehouse objects contain a tree list Processes Processes and Dimensions Dimensions from which it is required to select only one object, namely,Process Process or Dimension Dimension.

source: Объём — отображает объем значений, попавших в интервал (отображается в виде гистограммы).
en: Volume enables to display the volume of values included into the bin (it is displayed in the form of a histogram).

source: Ограничение количества значений — используется, чтобы ограничить максимальное количество колонок в выходном наборе, отбираются первые n сформированных полей, если установленное количество значений больше количества уникальных значений в колонках, то фиктивные столбцы не добавляются.
en: Value number limit is used to limit the maximum count of columns in the output data set. The first n generated fields are selected if the set number of values exceeds the number of the unique values in the columns, the fictitious columns are not added.

source: Ограничения Ограничения — позволяет задать ограничения на количество серий/точек:
en: Restrictions Restrictions enables to set restrictions concerning the number of series/points:

source: Ограничитель строк – символ, обрамляющий значения ячейки загружаемого набора данных.
en: Text qualifier: the character that frames cell values of the downloaded data set.

source: Ограничитель строк — символ, обрамляющий данные ячейки набора данных.
en: Text qualifier: the character that frames cell data of the data set.

source: Ограничить число выходных факторов — необязательный флаг, при активации которого можно задать ограничивающее число выходных факторов в соответствующем поле области.
en: Limit output factors number: an optional checkbox activation of which enables to set the limiting number of output factors in the corresponding field of the area.

source: Ограничить число итераций — искусственное прекращение работы алгоритма в случае, если количество итераций алгоритма превышает заданное максимальное число итераций.
en: Limit the number of iterations enables to terminate the algorithm operation deliberately if the algorithm iterations number exceeds the set maximum number of iterations.

source: Ограничить число кластеров — предполагает возможность вручную задать наибольшее количество кластеров, которые может выдать в результате алгоритм.
en: Limit the number of clusters enables to set the highest number of clusters that can be finally provided by the algorithm manually.

source: Один запрос в каждой строке входного запроса — каждая строка входной таблицы содержит параметры одного запроса к сервису.
en: One request per input request row: each row of the input table contains parameters of one request to the service.

source: Одиночная сортировка — сортировать колонку по текущему Индикатору.
en: Single sorting: sort the column by the current Indicator.

source: Одиночное — сбрасывает все существующее выделение и выделяет только текущую ячейку.
en: Single resets all current selection and selects only the current cell.

source: Окно настройки вычисляемого факта
en: Configuration window of the calculated measure

source: Окно форматирования
en: Formatting window

source: Округлять до заданной точности — округление разгруппированных значений до указанного количества цифр после запятой.
en: Round to the required decimal precision: rounding of ungrouped values to the specified number of digits following the decimal point.

source: Округлять до кратного целому — округление разгруппированных значений до чисел, кратных заданному целому числу.
en: Round to a multiple of a whole: rounding of ungrouped values to the numbers multiple to the set integer.

source: Описание API
en: API description

source: Описание — в этой форме можно оставить любую справочную информацию о подключении.
en: Description: it is possible to provide any reference connection data in this form.

source: Описание — в этом поле можно оставить любую справочную информацию о подключении.
en: Description: it is possible to provide any reference connection data in this field.

source: Описание — дополнительная информация по компоненту;
en: Description: additional information on the component.

source: Описание — поясняющая информация.
en: Description: clarifying information.

source: Определение выбросов и экстремальных значений — доступны два метода выявления:
en: Determination of outliers and extreme values: two detection methods are available:

source: Определить структуру автоматически — при установке данного флага активируется автоподбор параметров модели.
en: Auto detect structure: when this checkbox is selected, automatic selection of the model parameters is enabled.

source: Определяется алгоритмом — записи будут отобраны в соответствии с выбранным ранее методом сэмплинга;
en: Defined by algorithm: records will be selected according to the previously selected sampling method.

source: Определяется контекстом текущего процесса обработки (применяется по умолчанию) — режим выполнения с переобучением ("Всегда переобучать") или без переобучения ("Всегда выполнять") определяется следующими факторами:
en: Defined by the context of the current processing process (it is always used by default): the execution mode with retraining ("Always retrain") or without retraining ("Always run") is defined by the following factors:

source: Определяется набором - при выборе данного варианта становится доступен список Набор данных, определяющий набор строк, в нем необходимо выбрать набор, в соответствии с которым будет определяться количество строк результирующего набора.
en: Data set defined: when selecting this option, the Data set defining row count list becomes available. It is required to select a data set in it according to which the row count of the resulting data set will be defined.

source: Оптимизация:
en: Optimization:

source: Опубликован — указывает, был ли опубликован Пакет.
en: Published shows whether the Package was published.

source: Опубликованные пакеты — список уже опубликованных пакетов.
en: Published packages: the list of already published packages.

source: Основная таблица.
en: Main table.

source: Основная таблица
en: Main table

source: Основные столбцы — гистограмма, отображающая столбцы у дискретных гистограмм и сплошную заливку под непрерывной гладкой кривой у непрерывных.
en: Main columns: the histogram that displays the columns of the discrete histograms and the solid fill under the continuous smooth curve of the continuous ones.

source: Основные.
en: Main.

source: Оставлять неполные записи — сохраняет все добавленные узлом записи;
en: Leave incomplete records enables to save all records added by the node.

source: Останавливаться при ошибках — данный флаг отменит извлечение при обнаружении первой ошибки.
en: Halt on errors: this checkbox enables to cancel extraction when the first error is defined.

source: Останов при нулевой ошибки классификации — прекращение автоподбора при достижении нулевой ошибки классификации.
en: Stop at zero classification error enables to stop autofit when reaching zero classification error.

source: Отбор со смещением — в исходном наборе данных сокращается или увеличивается количество записей с выбранными уникальными значениями перед обработкой.
en: Biased sampling: the number of records with selected unique values is decreased or increased in the source data set before processing.

source: Отбор со смещением — после определения размера выборки дается возможность менять в ней количество записей с конкретными уникальными значениями.
en: Biased sampling: it is possible to change the number of records with specific unique values in the sample after definition of the sample size.

source: Отбор факторов и защита от переобучения — значение перечисления:
en: Factor selection and protection against overfitting - value of enumeration:

source: Отклонение — то же, что и "Индикатор", но опорная категория кодируется строкой из -1.
en: Deviation means the same as the "Indicator", but the reference category is encoded using the string that consists of -1.

source: Отключена (OFF).
en: Off (OFF).

source: Отключено — кэширование не будет производится.
en: Disabled means that caching will not be performed.

source: Открывался — дата и время открытия Пакета.
en: Open time: the date and time of the Package opening.

source: Открыть пакет — открытие ранее созданного пакета.
en: Open Package — opening of the earlier created package.

source: Открыть пакет — позволяет открыть существующий Пакет.
en: Open Package enables to open an existing Package.

source: Открыть — открытие существующего Пакета;
en: Open enables to open an existing Package.

source: Отмена — остановит закрытие Пакета либо дальнейшее закрытие еще не закрытых Пакетов.
en: Cancel will stop closing of the Package or further closing of still not closed Packages.

source: Отменить выбор всех Отменить выбор всех — убирает выбор всех строк;
en: Uncheck all Uncheck all enables to uncheck all rows.

source: Отменить выбор всех Отменить выбор всех — убрать выбор всех вариантов агрегации со всеми способами отображения.
en: Uncheck all Uncheck allenables to uncheck all aggregation options with all representation methods.

source: Относительные частоты Относительные частоты — столбцы генеральный совокупности одинаковые и растянуты до высоты ячейки.
en: Relative frequencies Relative frequencies: the universal set columns are equal and stretched to the cell height.

source: Относительный (для персонального использования) — вместо имени папки содержит точку.
en: Relative (for personal usage) contains a point instead of the folder name.

source: Отношение правдоподобия.
en: Likelihood ratio.

source: Отношение шансов
en: Odds ratio

source: Отношение — каждое значение делится на статистический показатель, либо на заданное пользователем значение.
en: Quotient: each value is divided by the statistical indicator or the value set by a user.

source: Отображаемый факт — позволяет выбрать отображаемый факт из списка.
en: Displayed measure enables to select the displayed measure from the list.

source: Отображать завершенные процессы — изменяет отображение процессов на панели:
en: Show completed processes enables to change display of the processes on the panel:

source: Отчет по линейной регрессии
en: Linear regression report

source: Отчет по регрессии Отчет по регрессии
en: Regression Report Regression Report

source: Отчеты
en: Reports

source: Официальный сайт производителя MS SQL Server.
en: Official website of the MS SQL Server manufacturer.

source: Официальный сайт производителя Oracle Database.
en: Official website of the Oracle Database manufacturer.

source: Официальный сайт производителя
en: Official manufacturer website

source: Официальный сайт производителя;
en: Official manufacturer website;

source: Официальный сайт разработчика Firebird.
en: Official website of the Firebird manufacturer.

source: Официальный сайт разработчика
en: Official developer website;

source: Официальный сайт разработчика;
en: Official developer website;

source: Очередность полей сортировки — в зависимости от позиции в списке Поля сортировки меняется очередность сортировки поля;
en: Order of sort fields: according to the item position in the Sort fields list, the field sorting order changes.

source: Очистить таблицу и заполнить данными — таблица базы данных будет полностью очищена и затем наполнена строками экспортируемой таблицы.
en: Clear table and fill in data enables to clear the database table completely and fill in with rows of the exported table.

source: Очистка содержимого (TRUNCATE).
en: Truncate (TRUNCATE).

source: Очищать пул при деактивации — очищает пул часто используемых в пакетной обработке и пакетов Loginom Integrator, сохраненных для быстрого вызова, после деактивации узла.
en: Clear pool when deactivated enables to clear the pool of the Loginom Integrator packages frequently used in the batch processing saved for the quick call upon the node deactivation.

source: Ошибка добавления LDAP пользователя в Loginom.
en: Error adding LDAP user to Loginom.

source: Ошибка — если встречается значение вне заданного диапазона, то при запуске узла выдается ошибка Нормализующее значение больше максимума диапазона значений.
en: Error: if the value that goes out of the given range is detected, the following error occurs when the node is started: Normalizing value exceeds the values range maximum.

source: Ошибка — стандартные ошибки коэффициентов корреляции для последовательности лагов данного диапазона;
en: Error: standard errors of the autocorrelation coefficients for a sequence of lags of the given bin.

source: Пакетное выполнение сценариев
en: Batch processing of workflows

source: Пакетное выполнение сценария;
en: Batch processing of workflow;

source: Пакетный режим — исполнение Сценариев Пакета без отображения какого-либо пользовательского интерфейса и вывода сообщений на экран.
en: Batch mode: execution of the Package Workflows without display of any user interface and screen display of messages.

source: Пакеты;
en: Packages

source: Панель «Процессы»
en: "Processes" panel

source: Панель «Процессы» — панель, содержащая подробную информацию о происходящих/происходивших процессах текущей сессии.
en: "Processes" panel: the panel that contains detailed information on the current/finished processes of the current session.

source: Панель инструментов
en: Toolbar

source: Панель сравнения кластеров.
en: Cluster Comparison Panel.

source: Панель сравнения кластеров
en: Cluster comparison panel

source: Панель сравнения кластеров Панель сравнения кластеров
en: Cluster Comparison Panel Cluster Comparison Panel

source: Панель сравнения кластеров условно можно разделить на две области (см.
en: Cluster comparison panel can be conventionally divided into two areas (refer to

source: Панель фильтрации.
en: Filtration panel.

source: Панель фильтрации
en: Filtration panel

source: Панель фильтрации Панель фильтрации
en: Filtration Panel Filtration Panel

source: Параллельная обработка — применяется для ускорения вычислений при работе цикла, количество потоков определяется параметром "максимальное количество потоков".
en: Parallel processing is used to speed up calculations during the loop operation. Thread count is defined by the "Maximum thread count" parameter.

source: Параллельность выполнения веток сценария.
en: Concurrency of workflow branches execution.

source: Параметр — метка параметра, при наведении курсора мыши появляется полное название метки.
en: Parameter: parameter caption. When cursor hovering, the full caption name appears.

source: Параметры диапазонов квантования
en: Parameters of binning ranges

source: Параметры полей
en: Features of fields

source: Параметры полей Параметры полей
en: Features of Fields Features of Fields

source: Параметры поля набора данных
en: Features of data set field

source: Параметры
en: Parameters

source: Параметры Параметры
en: Parameters Parameters

source: Параметры:
en: Parameters:

source: Пароль приватного ключа — пароль приватного ключа.
en: Private key password: private key password.

source: Пароль — пароль пользователя БД.
en: Password: password of the DB user.

source: Пароль — пароль пользователя БД;
en: Password: password of the DB user.

source: Пароль — пароль при подключении к файлу Microsoft Excel не используются;
en: Password is not used for connection to the Microsoft Excel file.

source: Пароль — поле становится активным если выбран тип Имя пользователя и пароль.
en: Password: the field becomes active if Username and password type is selected.

source: Пароль — указывается пароль, установленный пользователем БД для защиты данных.
en: Password: the password set by the DB user is specified for data protection.

source: Первый сценарий
en: The first workflow

source: Перейти к строке — перейти к строке с заданным номером (доступно в контекстном меню).
en: Go to row: go to the row with the set number (available in the context men).

source: Переключатель Особый формат — позволяет задать собственный формат отображения фактов, в случае если функционала стандартного форматирования недостаточно.
en: Switch Custom format enables to set own format of measures display if the standard formatting functionality is not sufficient.

source: Переключатель Отрицательные красным — отрицательные значения будут отображаться красным цветом.
en: Switch Negative in red: the negative values will be displayed in red.

source: Переключатель Форматирование:
en: Switch Formatting:

source: Переменная цикла — переменная, которой в ходе работы цикла присваивается номер текущей итерации.
en: Loop variable: the variable to which the current iteration number is assigned during the loop execution.

source: Переменная — выбор переменной для условия выхода из цикла.
en: Variable: selection of a variable for the loop exit condition.

source: Переменная — именованное значение одного из возможных типов данных.
en: Variable: the named value of one of the possible data types.

source: Переменная — именованный объект, который может содержать только одно значение определенного типа.
en: Variable: the named object that can contain only one value of the particular type.

source: Переменные в таблицу
en: Variables to table

source: Переменные в таблицу Переменные в таблицу
en: Variables to Table Variables to Table

source: Переменные в таблицу — преобразует набор переменных в таблицу данных;
en: Variables to table enable to transform a set of variables to a data table.

source: Переменные сценария
en: Workflow variables

source: Переместить вверх Переместить вверх — переместить вариант агрегации/способ отображения на позицию вверх;
en: Move up Move up enables to move the aggregation option/representation method one item position up.

source: Переместить вверх Переместить вверх — перемещает выделенные поля вверх по списку;
en: Move up Move up enables to move the selected fields up the list.

source: Переместить вверх Переместить вверх — перемещает выделенный элемент вверх по списку;
en: Move up Move up enables to move the selected item up the list.

source: Переместить вверх Переместить вверх — поднять выражение на одну позицию вверх по списку;
en: Move up Move up enables to move the expression one item position up the list.

source: Переместить вверх — перемещает выделенный элемент вверх по списку;
en: Move up enables to move the selected item up the list.

source: Переместить ветвь вниз Переместить вниз, Переместить ветвь вверх Переместить вверх — установить приоритет выделенной ветви путем её смещения относительно других ветвей;
en: Move branch down Move down, Move branch up Move up enable to prioritise the selected branch by its moving relative to other branches.

source: Переместить вниз Переместить вниз — опустить выражение на одну позицию вниз по списку;
en: Move down Move down enables to move the expression one item position down the list.

source: Переместить вниз Переместить вниз — переместить вариант агрегации/способ отображения на позицию вниз;
en: Move down Move down enables to move the aggregation option/representation method one item position down.

source: Переместить вниз Переместить вниз — перемещает выделенные поля вниз по списку;
en: Move down Move down enables to move the selected fields down the list.

source: Переместить вниз Переместить вниз — перемещает выделенный элемент вниз по списку.
en: Move down Move down enables to move the selected item down the list.

source: Переместить вниз Переместить вниз, Переместить вверх Переместить вверх — сместить выделенный порт в списке.
en: Move down Move down, Move up Move up enable to dislocate the selected port in the list.

source: Переместить вниз — перемещает выделенный элемент вниз по списку;
en: Move down enables to move the selected item down the list.

source: Переместить все Переместить в выбранные все — перемещает все доступные элементы в список Выбранные элементы.
en: Move all Move all to selected enables to transfer all available items to the Selected items list.
